# Задание 4: *Азбука Морзе

# Словарь для кодов Морзе
morse_code = {
    'A': '.-', 'B': '-...', 'C': '-.-.',
    'D': '-..', 'E': '.', 'F': '..-.',
    'G': '--.', 'H': '....', 'I': '..',
    'J': '.---', 'K': '-.-', 'L': '.-..',
    'M': '--', 'N': '-.', 'O': '---',
    'P': '.--.', 'Q': '--.-', 'R': '.-.',
    'S': '...', 'T': '-', 'U': '..-',
    'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..',
    '0': '-----', '1': '.----', '2': '..---',
    '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..',
    '9': '----.'
}

text = input("Введите текст: \n")

# Разбиваем текст на слова
words = text.split()

# Кодируем каждое слово в азбуку Морзе
morse_words = []
for word in words:
    morse_word = " ".join(morse_code[char.upper()] for char in word if char.upper() in morse_code)
    morse_words.append(morse_word)

# Вывод результата
for morse_word in morse_words:
    print(morse_word)
